{
  "HEADER": {
    "ABOUT_DEVELOPERS": "Über Entwickler",
    "ABOUT_PROJECT": "Über das Projekt",
    "ADD_OWN_LEVEL": "Füge dein Level hinzu"
  },
  "FOOTER": {
    "ABOUT_DEVELOPERS": "Über Entwickler",
    "ABOUT_PROJECT": "Über das Projekt",
    "ADD_OWN_LEVEL": "Füge dein Level hinzu",
    "SCENE_TYPE": {
      "RACCOON": "Waschbär",
      "CONSOLE": "Konsole",
      "PANDEMIC_HERO": "Pandemie-Held"
    }
  },
  "HOME": {
    "HOME": "Main page",
    "ADULTS_TO_YOUNG": "Erwachsene bis jung",
    "PROJECT_DESCRIPTION": "Kiddo ist eine Plattform, auf der Erwachsene Aufgaben entwickeln und Kinder diese lösen und lernen, in Python zu programmieren.",
    "ABOUT_PROJECT": "Über das Projekt",
    "LEVELS": "Levels:",
    "BANNERS": {
      "EMBED_KIDDO_INTO_SITE": "Sie können Kiddo in Ihre Site einbetten",
      "COPY_EMBED_CODE": "Kopieren Sie den Einbettungscode",
      "BECOME_KIDDO_AUTHOR": "Möchten Sie ein Kiddo-Autor werden?",
      "MAKE_OWN_LEVEL": "Mach dein eigenes Level"
    },
    "MODAL_MESSAGE": {
      "COPY_KIDDO": "Kopier Kiddo",
      "COPY": "Kopieren",
      "EMBED_KIDDO_INTO_SITE": "Sie können Kiddo in Ihre Site einbetten"
    },
    "SERVER_NOT_AVAILABLE": "Der Server ist nicht erreichbar"
  },
  "SCENE_TOGGLE": {
    "LEVEL": "Niveau",
    "LEVELS": "Niveaus",
    "RACCOON": "Waschbär",
    "CONSOLE": "Konsole",
    "PANDEMIC_HERO": "Pandemie-Held",
    "RACCOON_DESCRIPTION": "Löse Aufgaben und hilf Waschbären, Monstern auszuweichen und das beabsichtigte Ziel zu erreichen.",
    "CONSOLE_DESCRIPTION": "(TODO: translate) Консоль — эмулятор компьютерного терминала. Обычно так выглядит рабочий экран, на котором настоящие программисты разрабатывают и отлаживают программы. Решайте задачи и заставляйте компьютер выводить на консоль нужные значения.",
    "PANDEMIC_HERO_DESCRIPTION": "(TODO: translate) Kiddo были придуман во время пандемии коронавируса инженерами, которым надо было как-то занимать своих детей. В честь этого непростого времени придуманы уровни про Героя Панедмии, который не только решает задачи, но и правильно себя ведет с точки зрения врача."
  },
  "PAGE_NOT_FOUND": "Seite nicht gefunden",
  "MODAL": {
    "ACCEPT": "Akzeptieren"
  },
  "LEVEL_CARD": {
    "PLAY": "Spielen"
  },
  "GAME-PAGE": {
    "SCENE_TYPE": {
      "RACCOON": "Waschbär",
      "CONSOLE": "Konsole",
      "PANDEMIC_HERO": "Pandemie-Held",
      "NEW_YEAR": "Neujahr"
    },
    "LEVEL": "Niveau",
    "USING_MOBILE_WARNING": "TODO: translate. Если ты заходишь с мобильного телефона и страница кажется тебе неудобной, знай - так оно и есть! Пожалуйста, скопируй эту <a href='{{ link }}'>ссылку</a> и зайди с компьютера. Кодить с телефона крайне неудобно, поэтому получить максимум удовольствия ты сможешь, если откроешь полную версию этой страницы.",
    "TOOLTIP": {
      "PREVIOUS_LEVEL": "Previous level",
      "NEXT_LEVEL": "Next level"
    }
  },
  "TASK-EDITOR": {
    "TITLE": "Task editor",
    "USING_MOBILE_WARNING": "TODO: translate. Если ты заходишь с мобильного телефона и страница кажется тебе неудобной, знай - так оно и есть! Пожалуйста, скопируй эту <a href='{{ link }}'>ссылку</a> и зайди с компьютера. Кодить с телефона крайне неудобно, поэтому получить максимум удовольствия ты сможешь, если откроешь полную версию этой страницы."
  },
  "ABOUT-PROJECT-PAGE": {
    "HEADER": "Über das Projekt",
    "CONTENT-PARAGRAPH-1": "TODO: translate Kiddo — дитя самоизоляции. С весны 2020 года из-за пандемии коронавируса весь DataArt был вынужден работать из дома. Особенно непросто пришлось родителям — для детей надо придумывать какие-то занятия. Именно так и появился Kiddo — платформа, которая позволяет родителям-инженерам писать задачки и обучать детей программированию на Питоне.",
    "CONTENT-PARAGRAPH-2": "TODO: translate Kiddo пока не предназначен для того, чтобы учиться программированию с самого нуля. Для решения даже самых простых задачек надо разобраться в азах. Впрочем, учебников для самых начинающих в интернете очень много ({{ pythonTutorialsLinks }}), и любой ребенок за день-два поймет, как решать задачки в Kiddo — тем более, что мы предусмотрели подсказки.",
    "CONTENT-PARAGRAPH-3": "TODO: translate С самого начала мы решили, что Kiddo может пополнить любой желающий (<a href='{{ createLevelLink }}'>ССЫЛКА</a>). Задачки пишутся на JavaScript, и их сложность и затейливость зависит только от фантазии и энергичности автора. Для создания задачек с графическим полем можно использовать готовые наборы картинок, а можно рисовать свои.",
    "CONTENT-PARAGRAPH-4": "TODO: translate И последнее. Мы разрешаем встраивать Kiddo в любой сайт, который хочет учить детей Питону. Для этого надо скопировать код вставки (<a href='{{ copyKiddoLink }}'>ССЫЛКА</a>) — как у плейера YouTube. Если вам захочется добавить к Kiddo что-то свое, чтобы на вашем сайте он смотрелся органичнее, пишите CONTACT??? — что-нибудь придумаем."
  },
  "ABOUT-DEVELOPERS-PAGE": {
    "HEADER": "Über Entwickler",
    "CONTENT-PARAGRAPH-1": "TODO: translate DataArt — международная компания — разработчик программного обеспечения, которая никогда не забывает, что работает с людьми и для людей.",
    "CONTENT-PARAGRAPH-2": "TODO: translate Больше 20 лет опыта, сильные команды инженеров из разных стран, глубокие знания в разных областях бизнеса и готовность вкладывать силы в профессиональное развитие и образование коллег — все это позволяет нам создавать нестандартные решения, которые улучшают бизнес-процессы клиентов и открывают для них новые рынки. В соответствии с принципом «Прежде всего — люди», мы готовы работать с заказчиками любого масштаба, не ограничивая выбор технологий и адаптируясь по мере развития их бизнеса.",
    "CONTENT-PARAGRAPH-3": "TODO: translate Мы совмещаем глубокую техническую экспертизу с человеческими ценностями. Любознательность, сопереживание, доверие, искренность и интуиция определяют суть компании и взаимоотношения c партнерами. Эти качества помогают находить технологические решения, на которые наши клиенты могут положиться, и строить многолетние отношения, в которые они верят.",
    "CONTENT-PARAGRAPH-4": "(TODO: translate) Kiddo был создан в рамках Talent Lab, внутреннего инкубатора DataArt. В Talent Lab молодые разработчики под руководством опытных менторов решают реальные задачи и создают работающие продукты — часто для решения задач самого DataArt."
  },
  "CODE-EMBEDDING-PAGE": {
    "HEADER": "(TODO: translate) Вставка Kiddo",
    "CONTENT-PARAGRAPH-1": "(TODO: translate) Вы можете поставить игру Kiddo на свой сайт — как плейер YouTube. Для этого надо скопировать код и вставить его в код веб-сайта — опять-таки как плейер YouTube. На странице вашего сайта появится все, что на сайте Kiddo находится на черном фоне — задачки, условия, помощь, терминал, редактор ответов и так далее. Все, что находится под и над черным прямоугольником, на ваш сайт копироваться не будет.",
    "CONTENT-PARAGRAPH-2": "(TODO: translate) Если вы хотите, чтобы на сайте появились специальные задачки-уровни или даже целые разделы, пишите на адрес <a href='{{ link }}'>ССЫЛКА</a> — обсудим."
  },
  "LEVEL-TESTING-PAGE": {
    "HEADER": "Протестировать уровень",
    "LAUNCH": "Запустить"
  },
  "SCENE-CONFIGURATION-HELP-PAGE": {
    "HEADER": "Помощь"
  },
  "NEW-YEAR": {
    "PAGE_TITLE": "New year",
    "PAGE_SUBTITLE": "The Raccoon prepares for holidays! Help him solve the new year tasks!",
    "PAGE_DESCRIPTION": "It is miracle time! We've created special levels in the theme of New Year! The Raccoon is going to get to the christmas tree in search of gifts, making his way through mazes and dodging creepy monsters. We believe you can save the holiday!"
  }
}
