{
  "SCENE_TYPE": {
    "RACCOON": "Енот",
    "CONSOLE": "Консоль",
    "PANDEMIC_HERO": "Герой пандемии"
  },
  "HEADER": {
    "ABOUT_DEVELOPERS": "О разработчиках",
    "ABOUT_PROJECT": "О проекте",
    "ADD_OWN_LEVEL": "Добавить свой уровень"
  },
  "FOOTER": {
    "ABOUT_DEVELOPERS": "О разработчиках",
    "ABOUT_PROJECT": "О проекте",
    "ADD_OWN_LEVEL": "Добавить свой уровень",
    "SCENE_TYPE": {
      "RACCOON": "Енот",
      "CONSOLE": "Консоль",
      "PANDEMIC_HERO": "Герой пандемии"
    }
  },
  "HOME": {
    "HOME": "Главная",
    "ADULTS_TO_YOUNG": "Взрослые — молодым",
    "PROJECT_DESCRIPTION": "Kiddo — платформа, на которой взрослые придумывают задачки, а дети их решают и учатся программировать на Питоне.",
    "ABOUT_PROJECT": "О проекте",
    "LEVELS": "Уровни:",
    "BANNERS": {
      "EMBED_KIDDO_INTO_SITE": "Ты можешь вставить Kiddo в свой сайт",
      "COPY_EMBED_CODE": "Скопировать код встраивания",
      "BECOME_KIDDO_AUTHOR": "Хочешь стать автором Kiddo?",
      "MAKE_OWN_LEVEL": "Сделай свой собственный уровень"
    },
    "LEVEL-LAUNCHING": {
      "HEADER": "Проверить уровень",
      "INTRODUCTION": "Твой друг прислал код созданной им в редакторе задачи, и ты думаешь: \"а как эту задачу теперь запустить?\". Специально для таких случаев мы сделали страничку. Жми на эту <a href=\"{{ link }}\">ссылку</a>, и там ты сможешь запустить эту задачу."
    },
    "MODAL_MESSAGE": {
      "COPY_KIDDO": "Скопировать Kiddo",
      "COPY": "Скопировать",
      "EMBED_KIDDO_INTO_SITE": "Ты можешь вставить Kiddo в свой сайт"
    },
    "SERVER_NOT_AVAILABLE": "Сервер недоступен"
  },
  "SCENE_TOGGLE": {
    "LEVEL": "Уровень",
    "LEVELS": "Уровней",
    "RACCOON": "Енот",
    "CONSOLE": "Консоль",
    "PANDEMIC_HERO": "Герой пандемии",
    "RACCOON_DESCRIPTION": "Реши задачи и помоги Еноту увернуться от монстров и дойти до намеченной цели.",
    "CONSOLE_DESCRIPTION": "Консоль — эмулятор компьютерного терминала. Обычно так выглядит рабочий экран, на котором настоящие программисты разрабатывают и отлаживают программы. Решай задачи и заставляй компьютер выводить на консоль нужные значения.",
    "PANDEMIC_HERO_DESCRIPTION": "Kiddo были придуман во время пандемии коронавируса инженерами, которым надо было как-то занимать своих детей. В честь этого непростого времени придуманы уровни про Героя Панедмии, который не только решает задачи, но и правильно себя ведет с точки зрения врача."
  },
  "PAGE_NOT_FOUND": {
    "HEADER": "Ой! Страница не нашлась",
    "CONTENT": "Попробуй перейти на <a href='/'>главную страницу</a>. Если тебе кажется, что тебе нужна помощь, напиши нам по адресу: <a href='mailto:kiddo@dataart.com'>kiddo@dataart.com</a>."
  },
  "MODAL": {
    "ACCEPT": "Принять"
  },
  "LEVEL_CARD": {
    "PLAY": "Играть"
  },
  "GAME-PAGE": {
    "SCENE_TYPE": {
      "RACCOON": "Енот",
      "CONSOLE": "Консоль",
      "PANDEMIC_HERO": "Герой пандемии"
    },
    "LEVEL": "Уровень",
    "USING_MOBILE_WARNING": "Если ты заходишь с мобильного телефона и страница кажется тебе неудобной, знай - так оно и есть! Пожалуйста, скопируй эту <a href='{{ link }}'>ссылку</a> и зайди с компьютера. Кодить с телефона крайне неудобно, поэтому получить максимум удовольствия ты сможешь, если откроешь полную версию этой страницы.",
    "TOOLTIP": {
      "PREVIOUS_LEVEL": "Предыдущий уровень",
      "NEXT_LEVEL": "Следующий уровень"
    },
    "LEVEL_FETCH_ERROR": "Ошибка при загрузке уровня"
  },
  "TASK-EDITOR": {
    "TITLE": "Редактор задач",
    "USING_MOBILE_WARNING": "Если ты заходишь с мобильного телефона и страница кажется тебе неудобной, знай - так оно и есть! Пожалуйста, скопируй эту <a href='{{ link }}'>ссылку</a> и зайди с компьютера. Кодить с телефона крайне неудобно, поэтому получить максимум удовольствия ты сможешь, если откроешь полную версию этой страницы."
  },
  "ABOUT-PROJECT-PAGE": {
    "HEADER": "О проекте",
    "CONTENT-PARAGRAPH-1": "Kiddo — дитя самоизоляции. С весны 2020 года из-за пандемии коронавируса весь DataArt был вынужден работать из дома. Особенно непросто пришлось родителям — для детей надо придумывать какие-то занятия. Именно так и появился Kiddo — платформа, которая позволяет родителям-инженерам писать задачки и обучать детей программированию на Питоне.",
    "CONTENT-PARAGRAPH-2": "Kiddo пока не предназначен для того, чтобы учиться программированию с самого нуля. Для решения даже самых простых задачек надо разобраться в азах. Впрочем, учебников для самых начинающих в интернете очень много (например, канал <a href='{{ tutorialsLink1 }}' target='_blank' rel='nofollow'>Python Books</a> или сайт <a href='{{ tutorialsLink2 }}' target='_blank' rel='nofollow'>pythonworld.ru</a>), и любой ребенок за день-два поймет, как решать задачки в Kiddo — тем более, что мы предусмотрели подсказки.",
    "CONTENT-PARAGRAPH-3": "С самого начала мы решили, что Kiddo может пополнить <a href='{{ createLevelLink }}'>любой желающий</a>. Задачки пишутся на JavaScript, и их сложность и затейливость зависит только от фантазии и энергичности автора. Для создания задачек с графическим полем можно использовать готовые наборы картинок, а можно рисовать свои.",
    "CONTENT-PARAGRAPH-4": "И последнее. Мы разрешаем встраивать Kiddo в любой сайт, который хочет учить детей Питону. Для этого надо скопировать <a href='{{ copyKiddoLink }}'>код вставки</a> — как у плейера YouTube. Если тебе захочется добавить к Kiddo что-то свое, чтобы на твоём сайте он смотрелся органичнее, пиши нам на <a href='mailto:kiddo@dataart.com'>kiddo@dataart.com</a> — что-нибудь придумаем."
  },
  "ABOUT-DEVELOPERS-PAGE": {
    "HEADER": "О разработчиках",
    "CONTENT-PARAGRAPH-1": "DataArt — международная компания — разработчик программного обеспечения, которая никогда не забывает, что работает с людьми и для людей.",
    "CONTENT-PARAGRAPH-2": "Больше 20 лет опыта, сильные команды инженеров из разных стран, глубокие знания в разных областях бизнеса и готовность вкладывать силы в профессиональное развитие и образование коллег — все это позволяет нам создавать нестандартные решения, которые улучшают бизнес-процессы клиентов и открывают для них новые рынки. В соответствии с принципом «Прежде всего — люди», мы готовы работать с заказчиками любого масштаба, не ограничивая выбор технологий и адаптируясь по мере развития их бизнеса.",
    "CONTENT-PARAGRAPH-3": "Мы совмещаем глубокую техническую экспертизу с человеческими ценностями. Любознательность, сопереживание, доверие, искренность и интуиция определяют суть компании и взаимоотношения c партнерами. Эти качества помогают находить технологические решения, на которые наши клиенты могут положиться, и строить многолетние отношения, в которые они верят.",
    "CONTENT-PARAGRAPH-4": "Kiddo был создан в рамках Talent Lab, внутреннего инкубатора DataArt. В Talent Lab молодые разработчики под руководством опытных менторов решают реальные задачи и создают работающие продукты — часто для решения задач самого DataArt."
  },
  "CODE-EMBEDDING-PAGE": {
    "HEADER": "Вставка Kiddo"
  },
  "LEVEL-TESTING-PAGE": {
    "HEADER": "Проверить уровень",
    "INTRODUCTION": "Если ты хочешь запустить и проверить код собственноручно написанного уровня или запустить уровень, который прислал тебе кто-то из знакомых, то вставь код уровня в формате <a href=\"https://ru.wikipedia.org/wiki/YAML\" target=\"_blank\" rel=\"nofollow\" class=\"i18n-link\">YAML</a> в окно ниже и нажми \"запустить\".",
    "INITIAL_CODE": "# Код настройки уровня в формате YAML",
    "LAUNCH": "Запустить"
  },
  "SCENE-CONFIGURATION-HELP-PAGE": {
    "HEADER": "Помощь",
    "RACCOON_HELP": "{{ assetsPath }}/files/editor/helpInitialRaccoonRu.md?timestamp={{ timestamp }}",
    "CONSOLE_HELP": "{{ assetsPath }}/files/editor/helpInitialConsoleRu.md?timestamp={{ timestamp }}"
  },
  "MARKDOWN": {
    "CODE_EMBEDDING_MANUAL_TEST": "{{ domain }}/assets/files/code-embedding-manual-ru(test).md?timestamp={{ timestamp }}",
    "CODE_EMBEDDING_MANUAL_PROD": "{{ domain }}/assets/files/code-embedding-manual-ru(prod).md?timestamp={{ timestamp }}"
  }
}
