{
  "HEADER": {
    "ABOUT_DEVELOPERS": "Про розробників",
    "ABOUT_PROJECT": "Про проект",
    "ADD_OWN_LEVEL": "Додати свій рівень"
  },
  "FOOTER": {
    "ABOUT_DEVELOPERS": "Про розробників",
    "ABOUT_PROJECT": "Про проект",
    "ADD_OWN_LEVEL": "Додати свій рівень",
    "SCENE_TYPE": {
      "RACCOON": "Єнот",
      "CONSOLE": "Консоль",
      "PANDEMIC_HERO": "Герой пандемії"
    }
  },
  "HOME": {
    "HOME": "Головна сторінка",
    "ADULTS_TO_YOUNG": "Дорослі — молодим",
    "PROJECT_DESCRIPTION": "Kiddo — платформа, на якій дорослі придумують завдання, а діти їх вирішують і вчаться програмувати на Пітоні.",
    "ABOUT_PROJECT": "Про проект",
    "LEVELS": "Рівні:",
    "BANNERS": {
      "EMBED_KIDDO_INTO_SITE": "Ви можете вставити Kiddo в свій сайт",
      "COPY_EMBED_CODE": "Скопіювати код вбудовування",
      "BECOME_KIDDO_AUTHOR": "Хочеш стати автором Kiddo?",
      "MAKE_OWN_LEVEL": "Зроби свій власний рівень"
    },
    "LEVEL-LAUNCHING": {
      "HEADER": "Перевірити рівень",
      "INTRODUCTION": "Твій друг надіслав код створеної ним у редакторі задачі, і ти думаєш: \"А як цю задачу тепер запустити?\". Спеціально для таких випадків ми зробили сторінку. Тисни на це <a href=\"{{ link }}\">посилання</a> — там ти зможеш запустити цю задачу."
    },
    "MODAL_MESSAGE": {
      "COPY_KIDDO": "Скопіювати Kiddo",
      "COPY": "Скопіювати",
      "EMBED_KIDDO_INTO_SITE": "Ви можете вставити Kiddo в свій сайт"
    },
    "SERVER_NOT_AVAILABLE": "Сервер не доступний"
  },
  "SCENE_TOGGLE": {
    "LEVEL": "Рівень",
    "LEVELS": "Рівнів",
    "RACCOON": "Єнот",
    "CONSOLE": "Консоль",
    "PANDEMIC_HERO": "Герой пандемії",
    "RACCOON_DESCRIPTION": "Вирішіть завдання і допоможіть єноту ухилитися від монстрів і дійти до наміченої мети.",
    "CONSOLE_DESCRIPTION": "Консоль — емулятор комп'ютерного терміналу. Зазвичай так виглядає робочий екран, на якому справжні програмісти розробляють і налагоджують програми. Розв’язуй задачі та змушуй комп'ютер виводити на консоль потрібні значення.",
    "PANDEMIC_HERO_DESCRIPTION": "Kiddo був придуманий під час пандемії коронавірусу інженерами, яким мали чимось займати своїх дітей. На честь цього непростого часу придумані рівні про Героя Пандемії, який не тільки розв’язує задачі, а й правильно поводиться з точки зору лікаря."
  },
  "PAGE_NOT_FOUND": "Сторінка не знайдена",
  "MODAL": {
    "ACCEPT": "Прийняти"
  },
  "LEVEL_CARD": {
    "PLAY": "Грати"
  },
  "GAME-PAGE": {
    "SCENE_TYPE": {
      "RACCOON": "Єнот",
      "CONSOLE": "Консоль",
      "PANDEMIC_HERO": "Герой пандемії"
    },
    "LEVEL": "Рівень",
    "USING_MOBILE_WARNING": "Якщо ти заходиш з мобільного телефону і сторінка здається тобі незручною, знай — так і є! Будь ласка, скопіюй це посилання та зайди з комп'ютера. Кодити з телефону вкрай незручно. Отримати максимум задоволення ти зможеш, якщо відкриєш повну версію цієї сторінки.",
    "TOOLTIP": {
      "PREVIOUS_LEVEL": "Попередній рівень",
      "NEXT_LEVEL": "Наступний рівень"
    }
  },
  "TASK-EDITOR": {
    "TITLE": "Додати свій рівень",
    "USING_MOBILE_WARNING": "Якщо ти заходиш з мобільного телефону і сторінка здається тобі незручною, знай — так і є! Будь ласка, скопіюй це посилання та зайди з комп'ютера. Кодити з телефону вкрай незручно. Отримати максимум задоволення ти зможеш, якщо відкриєш повну версію цієї сторінки."
  },
  "ABOUT-PROJECT-PAGE": {
    "HEADER": "Про проект",
    "CONTENT-PARAGRAPH-1": "Kiddo — дитя самоізоляції. З весни 2020 року через пандемію коронавірусу весь DataArt був змушений працювати з дому. Особливо непросто довелося батькам — для дітей треба придумувати якісь заняття. Саме так з'явився Kiddo — платформа, що дозволяє батькам-інженерам писати задачки та навчати дітей програмуванню на Python.",
    "CONTENT-PARAGRAPH-2": "Kiddo поки не призначений для того, щоб вчитися програмуванню з нуля. Для розв’язання навіть найпростіших задач треба розібратися в азах. Втім, підручників для початківців в інтернеті безліч (наприклад, канал <a href='{{ tutorialsLink1 }}' target='_blank' rel='nofollow'>Python Books</a> або сайт <a href='{{ tutorialsLink2 }}' target='_blank' rel='nofollow'>pythonworld.ru</a>), і будь-яка дитина за день-два зрозуміє, як розв’язувати задачі в Kiddo. До того ж, ми передбачили підказки.",
    "CONTENT-PARAGRAPH-3": "З самого початку ми вирішили, що Kiddo може поповнити <a href='{{ createLevelLink }}'>кожен</a>, хто забажає. Задачки пишуться на JavaScript, їхня складність і вигадливість залежить тільки від фантазії та енергійності автора. Для створення задачок з графічним полем можна використовувати готові набори малюнків або малювати свої.",
    "CONTENT-PARAGRAPH-4": "І останнє. Ми дозволяємо вбудовувати Kiddo у будь-який сайт, який хоче навчати дітей Пітону. Для цього треба скопіювати <a href='{{ copyKiddoLink }}'>код вставки</a> — як у плеєра YouTube. Якщо ти забажаєш додати до Kiddo щось своє, щоб на твоєму сайті він виглядав більш органічно, пиши нам на <a href='mailto:kiddo@dataart.com'>kiddo@dataart.com</a> — щось придумаємо."
  },
  "ABOUT-DEVELOPERS-PAGE": {
    "HEADER": "Про розробників",
    "CONTENT-PARAGRAPH-1": "DataArt — міжнародна компанія — розробник програмного забезпечення, яка ніколи не забуває, що працює з людьми та для людей.",
    "CONTENT-PARAGRAPH-2": "Понад 20 років досвіду, сильні команди інженерів з різних країн, глибокі знання в різних сферах бізнесу та готовність вкладати сили у професійний розвиток і освіту колег — все це дозволяє нам створювати нестандартні рішення, які покращують бізнес-процеси клієнтів і відкривають для них нові ринки. Відповідно до принципу «Перш за все — люди», ми готові працювати з замовниками будь-якого масштабу, не обмежуючи вибір технологій та адаптуючись у міру розвитку їхнього бізнесу.",
    "CONTENT-PARAGRAPH-3": "Ми поєднуємо глибоку технічну експертизу з людськими цінностями. Допитливість, співпереживання, довіра, щирість і інтуїція визначають суть компанії та стосунки з партнерами. Ці якості допомагають знаходити технологічні рішення, на які наші клієнти можуть покластися, та будувати багаторічні стосунки, в які вони вірять.",
    "CONTENT-PARAGRAPH-4": "Kiddo був створений у рамках Talent Lab, внутрішнього інкубатора DataArt. У Talent Lab молоді розробники під керівництвом досвідчених менторів розв’язують реальні задачі та створюють працюючі продукти — часто для розв’язання задач самого DataArt."
  },
  "CODE-EMBEDDING-PAGE": {
    "HEADER": "Вставка Kiddo"
  },
  "LEVEL-TESTING-PAGE": {
    "HEADER": "Перевірити рівень",
    "INTRODUCTION": "Якщо ти хочеш запустити й перевірити код власноруч написаного рівня або запустити рівень, який надіслав тобі хтось зі знайомих, встав код рівня у форматі <a href=\"https://ru.wikipedia.org/wiki/YAML\" target=\"_blank\" rel=\"nofollow\" class=\"i18n-link\">YAML</a> у вікно нижче та натисни \"запустити\".",
    "INITIAL_CODE": "# Код налаштування рівня у форматі YAML",
    "LAUNCH": "Запустити"
  },
  "SCENE-CONFIGURATION-HELP-PAGE": {
    "HEADER": "Допомога",
    "RACCOON_HELP": "{{ assetsPath }}/files/editor/helpInitialRaccoonUa.md?timestamp={{ timestamp }}",
    "CONSOLE_HELP": "{{ assetsPath }}/files/editor/helpInitialConsoleUa.md?timestamp={{ timestamp }}",
    "PANDEMIC_HERO_HELP": "{{ assetsPath }}/files/editor/helpInitialPandemicUa.md?timestamp={{ timestamp }}"
  },
  "MARKDOWN": {
    "CODE_EMBEDDING_MANUAL_TEST": "{{ domain }}/assets/files/code-embedding-manual-ua(test).md?timestamp={{ timestamp }}",
    "CODE_EMBEDDING_MANUAL_PROD": "{{ domain }}/assets/files/code-embedding-manual-ua(prod).md?timestamp={{ timestamp }}"
  }
}
